/* Used when showing an invalid entry or input encountered when expecting a formal entry such as a number of date */
"\\U201c%@\\U201d" = "«%@»";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C" = "Недопустимое значение.";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C.a" = "Значение %@ недопустимо.";

/* NSKeyValueValidationError, suggestion string when a numeric value of an user input is invalid (for example too small or too large) */
"Err1024-R" = "Введите допустимое значение.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C" = "Недопустимое значение.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C.a" = "Значение %@ недопустимо.";

/* NSFormattingError, message shown when the numeric value of an entry or input is too small */
"Err2048-C.an" = "Значение слишком маленькое.";

/* NSFormattingError, message shown when the numeric value of an entry or input is too large */
"Err2048-C.ax" = "Значение слишком большое.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-R" = "Введите допустимое значение.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small */
"Err2048-R.n" = "Введите число не меньше %@.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small or too large */
"Err2048-R.nx" = "Введите число от %1$@ до %2$@.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too large */
"Err2048-R.x" = "Введите число не больше %@.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.an" = "Значение %@ слишком маленькое.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.ax" = "Значение %@ слишком большое.";

/* NSFileLockingError */
"Err255-C" = "Не удалось заблокировать файл.";

/* NSFileLockingError */
"Err255-R" = "Возможно, доступ к файлу уже закрыт, или у Вас нет разрешения на закрытие доступа.";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "Не удалось заблокировать файл «%@». ";

/* NSFileReadUnknownError */
"Err256" = "Не удалось открыть файл.";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "Не удалось открыть файл «%@». ";

/* NSFileReadNoPermissionError */
"Err257" = "Не удалось открыть файл, так как у Вас нет разрешения на его просмотр.";

/* NSFileReadNoPermissionError */
"Err257-C" = "У Вас нет разрешения.";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "Для просмотра или изменения прав доступа выберите объект в Finder, а затем нажмите «Файл» > «Свойства».";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "Не удалось открыть файл «%@», так как у Вас нет разрешения на его просмотр.";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "Недействительное имя файла.";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "Не удалось открыть объект, так как имя файла «%@» недействительно.";

/* NSFileReadCorruptFileError */
"Err259" = "Не удалось открыть файл, так как он имеет неверный формат.";

/* NSFileReadCorruptFileError */
"Err259-C" = "Файл имеет неверный формат.";

/* NSFileReadCorruptFileError */
"Err259-R" = "Возможно, файл поврежден, обрезан или имеет неизвестный формат.";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "Не удалось открыть файл «%@», так как он имеет неверный формат.";

/* NSFileReadNoSuchFileError */
"Err260" = "Не удалось открыть файл, так как он не существует.";

/* NSFileReadNoSuchFileError */
"Err260(Folder).f" = "Папка «%@» не существует.";

/* NSFileReadNoSuchFileError */
"Err260-C" = "Файл не существует.";

/* NSFileReadNoSuchFileError */
"Err260-C(Folder)" = "Папка не существует.";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "Не удалось открыть файл «%@», так как такого файла не существует.";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "Не удалось открыть файл, используя заданную кодировку текста.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "Заданная кодировка текста неприменима.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "Кодировка текста %@ неприменима.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "Файл, возможно, сохранен в другой кодировке текста, или это не текстовый файл.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "Не удалось открыть файл, используя кодировку текста %@.";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "Не удалось открыть файл «%2$@», используя кодировку текста %1$@.";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "Не удалось открыть файл, так как заданный тип URL не поддерживается.";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "Заданный тип URL не поддерживается.";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "Не удалось открыть файл «%1$@», так как тип URL %2$@ не поддерживается.";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "Не удалось открыть файл, так как тип URL %@ не поддерживается.";

/* NSFileReadTooLargeError */
"Err263" = "Не удалось открыть объект, так как он слишком большой.";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "Объект слишком большой.";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "Не удалось открыть объект «%@», так как он слишком большой.";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "Не удалось открыть файл, так как невозможно определить кодировку текста содержимого.";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "Не удалось определить кодировку текста содержимого.";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "Попробуйте открыть файл, указав кодировку текста.";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "Не удалось открыть файл «%@», так как невозможно определить кодировку текста его содержимого.";

/* NSUserCancelledError */
"Err3072-C" = "Операция отменена.";

/* NSFeatureUnsupportedError */
"Err3328" = "Операцию не удалось завершить, так как эта функция не поддерживается.";

/* NSFeatureUnsupportedError, argument is a file name */
"Err3328(Trash).f" = "Не удалось переместить в Корзину файл «%@», так как Корзина в этом томе отсутствует.";

/* NSFeatureUnsupportedError, argument is a file name and volume name */
"Err3328(Trash).fv" = "Не удалось переместить в Корзину файл «%1$@», так как Корзина в томе «%2$@» отсутствует.";

/* NSFeatureUnsupportedError */
"Err3328-C" = "Запрошенная операция не поддерживается.";

/* NSFeatureUnsupportedError */
"Err3328-C(Trash)" = "Корзина в этом томе отсутствует.";

/* NSPropertyListCorruptError */
"Err3840" = "Не удалось считать данные, так как они повреждены";

/* NSPropertyListCorruptError */
"Err3840-C" = "Данные повреждены.";

/* NSPropertyListUnknownVersionError */
"Err3841" = "Не удалось считать данные, так как эта программа не поддерживает их формат.";

/* NSPropertyListUnknownVersionError */
"Err3841-C" = "Эта программа не поддерживает такой формат данных.";

/* NSPropertyListReadStreamError */
"Err3842" = "Не удалось считать данные из-за ошибки в источнике данных.";

/* NSPropertyListReadStreamError */
"Err3842-C" = "Произошла ошибка в источнике данных.";

/* NSPropertyListWriteStreamError */
"Err3851" = "Не удалось записать данные из-за ошибки в месте назначения данных.";

/* NSPropertyListWriteStreamError */
"Err3851-C" = "Произошла ошибка в месте назначения данных.";

/* NSFileNoSuchFileError, argument is a folder name */
"Err4(Folder).f" = "Папка «%@» не существует.";

/* NSFileNoSuchFileError, first arg: source file, second arg: destination file */
"Err4(Move).fp" = "Не удалось переместить «%1$@» в «%2$@», так как объект не существует или папка, в которую он должен быть перемещен, не существует.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "Не удалось удалить «%@».";

/* NSFileNoSuchFileError */
"Err4-C" = "Файл не существует.";

/* NSFileNoSuchFileError, applied to a folder */
"Err4-C(Folder)" = "Папка не существует.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "Файл «%@» не существует.";

/* Message shown when the connection to a helper application is interrupted due to the helper application exiting. */
"Err4097" = "Не удалось установить связь с программой-помощником.";

/* Recovery suggestion for message shown when the connection to a helper application is interrupted. */
"Err4097-R" = "Повторите операцию. В случае неудачи завершите программу и перезапустите ее.";

/* Message shown when the connection to a helper application is interrupted and can not be reestablished. */
"Err4099" = "Не удалось установить связь с программой-помощником.";

/* Recovery suggestion for message shown when the connection to a helper application is interrupted. */
"Err4099-R" = "Повторите операцию. В случае неудачи завершите программу и перезапустите ее.";

/* Message shown when the connection to a helper application is invalidated due to a corrupted response. */
"Err4101" = "Не удалось установить связь с программой-помощником.";

/* Recovery suggestion for message shown when the connection to a helper application is interrupted. */
"Err4101-R" = "Повторите операцию. В случае неудачи завершите программу и перезапустите ее.";

/* NSFileWriteUnknownError */
"Err512" = "Не удалось сохранить файл.";

/* NSFileWriteUnknownError, when the save of the specified file fails because the backup file for the saved file can't be created or updated */
"Err512(Backup).f" = "Не удалось сохранить файл «%1$@», так как файл резервной копии не может быть обновлен.";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "Не удалось скопировать «%1$@» в «%2$@».";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "Не удалось связать «%1$@» с «%2$@».";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "Не удалось переместить «%1$@» в «%2$@».";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "Не удалось удалить «%@».";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Trash).f" = "Не удалось переместить в Корзину файл «%@».";

/* NSFileWriteUnknownError, when the save of a file fails because the backup file can't be created or updated */
"Err512-C(Backup)" = "Не удалось сохранить файл резервной копии.";

/* NSFileWriteUnknownError, recovery suggestion for when the save of a file fails because the backup file can't be created or updated */
"Err512-R(Backup)" = "Возможно, файл резервной копии заблокирован или у Вас недостаточно прав для его сохранения. Для просмотра и изменения прав доступа выберите файл в Finder, затем нажмите «Файл» > «Свойства».";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "Не удалось сохранить файл «%2$@» в папке «%1$@».";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "Не удалось сохранить файл «%@». ";

/* NSFileWriteNoPermissionError */
"Err513" = "Не удалось сохранить файл, так как у Вас нет на это разрешения.";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "Не удалось скопировать «%1$@», так как у Вас нет прав доступа к «%2$@».";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "Не удалось связать «%1$@», так как у Вас нет прав доступа к «%2$@».";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "Не удалось переместить «%1$@», так как у Вас нет прав доступа к «%2$@».";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "Не удалось удалить «%@», так как у Вас нет прав доступа.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Trash).f" = "Не удалось переместить в Корзину файл «%@», так как у Вас нет прав доступа к нему.";

/* NSFileWriteNoPermissionError */
"Err513-C" = "У Вас нет разрешения.";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "Для просмотра или изменения прав доступа выберите объект в Finder, а затем нажмите «Файл» > «Свойства».";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "У Вас нет разрешения на сохранение файла «%2$@» в папке «%1$@».";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "У Вас нет разрешения на сохранение файла «%@».";

/* NSFileWriteInvalidFileNameError */
"Err514" = "Не удалось сохранить объект, так как имя файла недействительно.";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "Не удалось удалить объект, так как имя файла «%@» недействительно.";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "Недействительное имя файла.";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "Не удалось сохранить объект, так как имя файла «%@» недействительно.";

/* NSFileWriteFileExistsError */
"Err516" = "Не удалось сохранить файл, так как файл с таким именем уже существует.";

/* NSFileWriteFileExistsError, first arg: source, second arg: destination */
"Err516(Copy).fp" = "Не удалось скопировать «%1$@» в «%2$@», так как объект с таким именем уже существует.";

/* NSFileWriteFileExistsError, first arg: source, second arg: destination */
"Err516(Link).fp" = "Не удалось связать «%1$@» с «%2$@», так как объект с таким именем уже существует.";

/* NSFileWriteFileExistsError, first arg: source, second arg: destination */
"Err516(Move).fp" = "Не удалось переместить «%1$@» в «%2$@», так как объект с таким именем уже существует.";

/* NSFileWriteFileExistsError */
"Err516-C" = "Файл с таким именем уже существует.";

/* NSFileWriteFileExistsError, argument is a file name */
"Err516-C.f" = "Файл с именем «%@» уже существует.";

/* NSFileWriteFileExistsError */
"Err516-R" = "Чтобы сохранить файл, выберите другое имя или местоположение, либо удалите существующий файл и повторите попытку.";

/* NSFileWriteFileExistsError, first arg: destination folder, second arg: a file name */
"Err516.df" = "Не удалось сохранить файл «%2$@» в папке «%1$@», так как файл с таким именем уже существует.";

/* NSFileWriteFileExistsError, argument is a file name */
"Err516.f" = "Не удалось сохранить файл «%@», так как файл с таким именем уже существует.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "Не удалось сохранить файл, используя заданную кодировку текста.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "Заданная кодировка текста неприменима.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "Кодировка текста %@ неприменима.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "Если возможно, выберите другую кодировку текста.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "Не удалось сохранить файл, используя кодировку текста %@.";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "Не удалось сохранить файл «%2$@», используя кодировку текста %1$@.";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "Не удалось сохранить файл, так как заданный тип URL не поддерживается.";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "Заданный тип URL не поддерживается.";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "Не удалось сохранить файл «%1$@», так как тип URL %2$@ не поддерживается.";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "Не удалось сохранить файл, так как тип URL %@ не поддерживается.";

/* NSFileWriteOutOfSpaceError */
"Err640" = "Не удалось сохранить файл, так как недостаточно свободного места.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "Не удалось скопировать «%1$@» в «%2$@» из-за недостатка свободного места.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "Не удалось связать «%1$@» с «%2$@», так как недостаточно свободного места.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "Не удалось переместить «%1$@» в «%2$@», так как недостаточно свободного места.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640(Trash).f" = "Не удалось переместить в Корзину файл «%@», так как недостаточно свободного места.";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "Недостаточно места.";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "На томе «%@» нет места.";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "Удалите некоторые файлы из тома и повторите попытку.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "Невозможно сохранить файл «%@», так как недостаточно свободного места.";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "Невозможно сохранить файл «%1$@», так как на томе «%2$@» нет места.";

/* NSFileWriteVolumeReadOnlyError */
"Err642" = "Не удалось сохранить файл, так как том доступен только для чтения.";

/* NSFileWriteVolumeReadOnlyError, argument is a file name */
"Err642(Trash).f" = "Не удалось переместить в Корзину файл «%@», так как том предназначен только для чтения.";

/* NSFileWriteVolumeReadOnlyError */
"Err642-C" = "Том доступен только для чтения.";

/* NSFileWriteVolumeReadOnlyError, argument is volume name */
"Err642-C.v" = "Том «%@» доступен только для чтения.";

/* NSFileWriteVolumeReadOnlyError */
"Err642-R" = "Попробуйте сохранить файл в другой том.";

/* NSFileWriteVolumeReadOnlyError, argument is a file name */
"Err642.f" = "Невозможно сохранить файл «%@», так как том доступен только для чтения.";

/* NSFileWriteVolumeReadOnlyError, arguments are file name and volume name */
"Err642.fv" = "Невозможно сохранить файл «%1$@», так как том «%2$@» доступен только для чтения.";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"The operation couldn\\U2019t be completed. (%1$@ error %2$ld.)" = "Не удалось завершить операцию. (%1$@, ошибка %2$ld)";

